Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Lullaby.tmx
Source language: en
Languages: es_419

source: I worked so hard to try and win this.
es_419: me esforcé mucho para lograr eso.

source: huh? where did he go?
es_419: ¿eh? ¿a dónde se fue?

source: I don’t have the keen judgment or experience you do, so I need to dedicate all the time I have to this project,
es_419: al no contar con su buen criterio o experiencia, tengo que dedicarle todo el tiempo que pueda al proyecto…

source: that was an americano, and this is a sweet coffee.
es_419: ese era un americano y este es un café dulce.

source: is she eagerly waiting for the day I leave?
es_419: ¿está contando los días para que me vaya?

source: what time do you usually eat your breakfast?
es_419: ¿a qué hora suele desayunar?

source: no one will welcome an unworthy king.
es_419: nadie aceptará a un rey indigno.

source: 'cause I need to go to the sauna.
es_419: porque quiero ir al sauna.

source: I don’t mean anything else to you other than that, do I?
es_419: no significo más que eso para usted, ¿no es así?

source: it's been a while since a gns employee came here.
es_419: hace bastante que no venía personal de dne aquí.

source: THIS IS WHERE THEY CAME
es_419: AQUÍ VINIERON

source: hah. this is it for today's list.
es_419: bueno, terminé por hoy.

source: ...do you really not trust me?
es_419: ¿en serio no confías en mí?

source: that's good.
es_419: qué bien.

source: take a seat.
es_419: siéntate.

source: aren’t you pleased about winning first place?
es_419: ¿no estás contenta de haber ganado?

source: make sure she drinks enough water and gets plenty of rest.
es_419: asegúrese de que se hidrate y que descanse mucho.

source: sorry, but this isn't going to do anything.
es_419: perdón, pero esto no solucionará nada.

source: why does he keep staring at me?
es_419: ¿por qué no para de mirarme?

source: it’s remarkable how much she cares about other people...
es_419: es admirable cómo se preocupa por los demás.

source: I didn’t realize you cared about me so deeply.
es_419: no sabía que te preocupabas tanto por mí.

source: no, I’m available!
es_419: ¡no! ¡estoy disponible!

source: was the most satisfying deed I’ve accomplished in the past 600 years.
es_419: ha sido mi mayor mérito en los últimos 600 años.

source: you should go find out what's going on right now.
es_419: debes averiguar qué está pasando.

source: ugh. maybe I shouldn't have said that...
es_419: ugh. quizá fue una mala idea.

source: besides...
es_419: además,

source: let’s head home first.
es_419: vamos a casa primero.

source: I was worried that you'd get sick.
es_419: me preocupaba que te enfermaras.

source: I thought synchronization was only sleep-related. it seems like that rule no longer applies.
es_419: creí que solo se sincronizaban las cuestiones relacionadas con el sueño. parece que va mucho más allá.

source: wow, I can’t believe it...
es_419: vaya, no puedo creerlo.

source: drunk
es_419: EBRIA

source: don't hesitate to let me know if you need anything.
es_419: no dudes en pedirme lo que necesites.

source: only eat nice food, miss seohwa...
es_419: señorita seohwa, quiero que te alimentes bien…

source: do me a favor, miss seohwa.
es_419: hazme un favor, seohwa.

source: I suppose there is miss seohwa...
es_419: supongo que me queda seohwa.

source: shrug
es_419: SE ENCOGE

source: it looks like we finally fell alseep.
es_419: por fin pudimos dormir.

source: a little while ago, when you handed me the marble that fell from my wangjin, I had a vision of sorts.
es_419: hace unos días, cuando me diste la canica que se me había caído del wangjin, tuve una visión.

source: remove this as well.
es_419: y quíteme esto.

source: bye, mr. yeonuuu!
es_419: ¡adiós, yeonuuu!

source: ...stay at my place after work.
es_419: … quiero que vivas en mi casa.

source: well, you did ask me to submit a detailed project plan by tomorrow.
es_419: bueno, usted me pidió un plan de proyecto detallado para mañana.

source: just this once... please?
es_419: ¡vamos, una sola vez!

source: it's done now.
es_419: ya está.

source: I fell into such a deep sleep. that could’ve been real dangerous.
es_419: me dormí muy profundamente. podría haber sido una tragedia.

source: I’ve been feeling a little uneasy about you these days, miss seohwa.
es_419: últimamente, sospecho que me ocultas algo, seohwa.

source: thank you for the food!
es_419: ¡gracias, señor gam!

source: that's why...
es_419: por eso…

source: why do you care?
es_419: ¿acaso te importa?

source: I understand why you’re curious. but isn’t the present what matters most, regardless of what happened in the past?
es_419: entiendo su curiosidad. pero, al margen de lo que haya ocurrido en el pasado, ¿acaso no es el presente lo que más importa?

source: anyway, congratulations. it’s great to see all your hard work bearing fruit.
es_419: ah, y felicitaciones. qué bueno que tu esfuerzo esté rindiendo frutos.

source: I’m feeling pretty tired too.
es_419: yo también estoy cansado.

source: I wish I’d known about this a little sooner.
es_419: ojalá lo hubiera sabido desde antes.

source: I should be more careful about mr. gam, especially when I’m around him.
es_419: debo ser más cuidadosa cuando pienso en el señor gam, sobre todo cuando está cerca.

source: this is precisely why you don’t belong in the demon world.
es_419: no cabe duda de que no perteneces al mundo de los demonios.

source: is something troubling you?
es_419: ¿te sientes bien?

source: I'll get that taken care of immediately!
es_419: ¡me encargaré de eso de inmediato!

source: bring me the hourglass.
es_419: tráeme el reloj de arena.

source: besides, we started working here at the same time and it’d be nice to get to know each other...
es_419: además, empezamos a trabajar aquí al mismo tiempo, y me encantaría conocernos mejor…

source: yes... no?
es_419: sí… ¿no?

source: you're feeling sick because you worry about minor things.
es_419: te sientes mal porque te preocupas por nimiedades.

source: that means I'm gonna have to sleep when she does.
es_419: es decir que vamos a tener que dormir al mismo tiempo.

source: excuse me, I have absolutely no intention to be with you.
es_419: disculpe, no tengo ninguna intención de estar con usted.

source: Art by
es_419: Arte:

source: ...lie down and get comfortable.
es_419: … recuéstate y ponte cómoda.

source: see you...
es_419: adiós…

source: you’re not planning on coming, are you?
es_419: no está pensando en venir, ¿cierto?

source: I’m so so glad to see youuu!
es_419: ¡me alegra mucho verlooo!

source: last time, you expected me to mouth feed you.
es_419: el otro día querías que te diera de comer en la boca.

source: ohh, I guess it's a weekend.
es_419: ah, por ser fin de semana supongo.

source: wander
es_419: DEAMBULA

source: mr. gam, I made a mistake not recognizing you.
es_419: señor gam, cometí un error al no reconocerlo antes.

source: I shouldn't really say this as a doctor but...
es_419: como médico, no debería decir esto,

source: why do you care about me so much?
es_419: ¿por qué te importo tanto?

source: an hourglass with a bunch of white threads draped over it... they look like cobwebs.
es_419: un reloj de arena cubierto de hilos blancos que parecen telarañas…

source: like this?
es_419: ¿así?

source: I was worried about why this wasn’t working after trying so many different things, but I'm so glad it all worked out.
es_419: me preocupaba que no pudieran dormir después de probar tantas cosas, pero me alegra que lo hayan logrado.

source: I tried so hard to get into this company... if I'm gonna die, I should die here...
es_419: me esforcé tanto por entrar a esta compañía que, si muero, debería ser aquí.

source: I helped you recover your strength using my demonic energy.
es_419: te ayudé a recuperarte con mi energía demoníaca.

source: it looks like you'll be dragged into everything that woman does now.
es_419: parece que, de ahora en más, esa mujer lo arrastrará a todo lo que haga.

source: I thought you were gonna say no.
es_419: creí que me iba a decir que no.

source: I told you. it's not something I choose.
es_419: ya te dije. no es mi elección.

source: at this rate, I think I’ll have another nightmare if I fall asleep.
es_419: a este ritmo, creo que tendré otra pesadilla si me vuelvo a dormir.

source: that’s the exact same thing he said in my dream!
es_419: ¡es justo lo que me dijo en mi pesadilla!

source: it's something we need to do alone though.
es_419: pero es algo que tenemos que hacer a solas.

source: it seems like confusing and disconcerting things like this happen every time I’m with her.
es_419: parece que, cada vez que estoy con ella, me pasan cosas confusas y desconcertantes.

source: you were probably worried about yourself, not me.
es_419: creo que estaba preocupado por usted, no por mí,

source: why is she bringing that up all of the sudden?
es_419: ¿por qué, de pronto, me habla de eso?

source: anyway, what is this on my wrist...?
es_419: ¿qué será esto que tengo en la muñeca?

source: you are going to feel each other's breathing, and maintain a similar biological rhythm.
es_419: van a sentir la respiración del otro y mantener un ritmo biológico similar.

source: I can tell something’s bothering you... so you aren’t going to tell me about it this time either?
es_419: es evidente que algo te molesta. ¿tampoco piensas contarme esta vez?

source: ...I become strangely impulsive.
es_419: cuando estoy contigo, me vuelvo impulsivo.

source: how is she seeing something I can't even see...?
es_419: ¿cómo puede ser que ella vea algo que yo no?

source: I can’t see what’s happening inside very well...
es_419: no puedo ver bien lo que pasa ahí adentro.

source: oh!
es_419: ¡ah!

source: don't worry.
es_419: tranquila.

source: I know you’re making it all up.
es_419: ya sé que estás mintiendo.

source: why are you going to the 15th floor anyway? are you going there to meet with someone?
es_419: ¿y por qué vas al 15.º piso? ¿vas a reunirte con alguien ahí?

source: I’ve worked out very hard at home to your videos!
es_419: ¡gracias a sus videos, he entrenado mucho en casa!

source: I was just worried because you suddenly disappeared.
es_419: me tenía preocupada porque desapareció de pronto.

source: how many more times do I have to tell you to eat better and stay healthy?
es_419: ¿cuántas veces tengo que repetirte que comas mejor y cuides tu salud?

source: what would that young trainer know about yoga? you'll learn much more from me.
es_419: ¿qué puede saber sobre yoga ese entrenador mocoso? yo te enseñaré más.

source: excuse me, miss lee? what did you just say to me?
es_419: ¿perdón, señorita lee? ¿qué me dijo recién?

source: it's because he would do anything to become the king of the demon world.
es_419: porque haría cualquier cosa con tal de convertirse en el rey de los demonios.

source: this is something I really wanted... but I don’t know what to do anymore.
es_419: esto es lo que tanto quería, pero ya no sé qué hacer.

source: ...you should work at this desk for now.
es_419: … debes trabajar en este escritorio por ahora.

source: it doesn’t make sense that I’d only have forgotten everything about you.
es_419: no tiene sentido que solamente haya olvidado todo lo relacionado a ti.

source: I'll end your life.
es_419: te mataré.

source: sniffle
es_419: SNIF

source: miss seohwa needs to focus on the new project launch for the time being, and so will be working late every day.
es_419: por ahora, la señorita seohwa debe enfocarse en el proyecto nuevo, por lo que trabajará hasta tarde todos los días.

source: it's not like anything really bad could've happened... you didn't have to...
es_419: tampoco fue para tanto. no era necesario que me…

source: anyway, why are you even trying to come back? the demon world is now mine.
es_419: en fin, ¿por qué intentas regresar? ahora el mundo de los demonios me pertenece.

source: oops.
es_419: ¡ups!

source: still, this is inappropriate! we're basically in the same room.
es_419: ¡pero es inapropiado! es como estar en el mismo cuarto.

source: I knew it...!
es_419: ¡lo sabía!

source: mr. gam always keeps his word. that’s why I trust him.
es_419: el señor gam es un hombre de palabra. por eso confío en él.

source: providing a good night’s rest to humans...
es_419: ayudar a dormir a los humanos…

source: but I want to. please just stay still.
es_419: pero quiero hacerlo. quédate quieta.

source: I wonder what those eyes were trying to say.
es_419: ¿qué habrá querido decir esa mirada?

source: wait, he's not a man. mr. gam isn't even a human...
es_419: momento, no es un hombre. el señor gam no es humano.

source: my "partner" isn't feeling very well.
es_419: mi “compañera” no se siente muy bien.

source: she didn’t even bother to give me a call!
es_419: ¡ni siquiera se molestó en llamarme!

source: I had no idea it would be this hard.
es_419: no imaginé que sería tan difícil.

source: but is it safe for him to fall asleep right in front of an open flame like that?
es_419: pero ¿será seguro que se duerma delante de la fogata?
